# pandas 入门

* 版本号： 0.1
* 创建时间： 2015年 02月 07日 星期六 10:26:33 CST
* 修改时间： 2015年 03月 21日 星期六 12:28:33 CST
* 数据来源：
 * movies.csv http://boxofficemojo.com/daily/
 * iris.csv https://github.com/dsaber/py-viz-blog
 * titanic.csv https://github.com/dsaber/py-viz-blog
 * ts.csv https://github.com/dsaber/py-viz-blog

## 建立环境

### 安装 pandas

    sudo apt-get install build-essential python-dev 
    sudo apt-get install python-pandas python-tk
    sudo apt-get install python-scipy python-matplotlib python-tables
    sudo apt-get install python-numexpr python-xlrd python-statsmodels
    sudo apt-get install python-openpyxl python-xlwt python-bs4
    
    if use virtualenv before install matplotlib should install libpng-dev, libjpeg8-dev, libfreetype6-dev

### 安装 ipython-notebook

    sudo pip install "ipython[notebook]"
    sudo pip install pygments

### 运行 ipython-notebook

    ipython notebook
    #如果你使用matplotlib内嵌进网页中,那么需要运行:
    ipython notebook --matplotlib inline

## 导入 pandas

In [24]:
import pandas as pd
import numpy as np

## 读入数据

In [25]:
# 读入 CSV 格式数据
df_movies = pd.read_csv('datas/movies.csv', sep='\t', encoding='utf-8')
df_movies.head()

   Row     Date  Day  Day# Top 10 Gross         #1 Movie        Gross
0    1  Jan. 30  Fri    30  $26,168,351  American Sniper   $9,905,616
1    2  Jan. 31  Sat    31  $41,633,588  American Sniper  $16,510,536
2    3   Feb. 1  Sun    32  $12,515,579  American Sniper   $4,244,376
3    4   Feb. 2  Mon    33   $6,475,068  American Sniper   $2,645,109
4    5   Feb. 3  Tue    34   $7,825,091  American Sniper   $2,923,141

In [26]:
df_movies = pd.read_csv('datas/movies.csv', sep='\t', encoding='utf-8',thousands=',',escapechar='$')
df_movies.head()

   Row     Date  Day  Day#  Top 10 Gross         #1 Movie     Gross
0    1  Jan. 30  Fri    30      26168351  American Sniper   9905616
1    2  Jan. 31  Sat    31      41633588  American Sniper  16510536
2    3   Feb. 1  Sun    32      12515579  American Sniper   4244376
3    4   Feb. 2  Mon    33       6475068  American Sniper   2645109
4    5   Feb. 3  Tue    34       7825091  American Sniper   2923141

从数据库读入数据参见：http://stackoverflow.com/questions/10065051/python-pandas-and-databases-like-mysql

## 复制数据

In [27]:
df = df_movies.copy()
df.head(3)

   Row     Date  Day  Day#  Top 10 Gross         #1 Movie     Gross
0    1  Jan. 30  Fri    30      26168351  American Sniper   9905616
1    2  Jan. 31  Sat    31      41633588  American Sniper  16510536
2    3   Feb. 1  Sun    32      12515579  American Sniper   4244376

## 导出数据

In [28]:
#导出周六的数据，格式为 CSV
df[ (df['Day'] == 'Sat') ].to_csv('test_output.csv', mode='w', encoding='utf-8', index=False)

In [29]:
#在前面的文件中追加周日的数据
df[ (df['Day'] == 'Sun') ].to_csv('test_output.csv', mode='a', header=False, encoding='utf-8', index=False)

## 显示数据

In [30]:
#显示开头的数据，缺省显示 5 条
df.head()

   Row     Date  Day  Day#  Top 10 Gross         #1 Movie     Gross
0    1  Jan. 30  Fri    30      26168351  American Sniper   9905616
1    2  Jan. 31  Sat    31      41633588  American Sniper  16510536
2    3   Feb. 1  Sun    32      12515579  American Sniper   4244376
3    4   Feb. 2  Mon    33       6475068  American Sniper   2645109
4    5   Feb. 3  Tue    34       7825091  American Sniper   2923141

In [31]:
#显示开头的数据，指定显示 3 条
df.head(3)

   Row     Date  Day  Day#  Top 10 Gross         #1 Movie     Gross
0    1  Jan. 30  Fri    30      26168351  American Sniper   9905616
1    2  Jan. 31  Sat    31      41633588  American Sniper  16510536
2    3   Feb. 1  Sun    32      12515579  American Sniper   4244376

In [32]:
#显示末尾的数据，缺省显示 5 条
df.tail()

    Row     Date  Day  Day#  Top 10 Gross              #1 Movie    Gross
24   25  Feb. 23  Mon    54       7385671  Fifty Shades of Grey  1846390
25   26  Feb. 24  Tue    55       9424126  Fifty Shades of Grey  2265910
26   27  Feb. 25  Wed    56       6862942  Fifty Shades of Grey  1772230
27   28  Feb. 26  Thu    57       7161773  Fifty Shades of Grey  1790520
28   29  Feb. 27  Fri    58      26457000          Focus (2015)  6465000

In [33]:
#显示末尾的数据，缺省显示 2 条
df.tail(2)

    Row     Date  Day  Day#  Top 10 Gross              #1 Movie    Gross
27   28  Feb. 26  Thu    57       7161773  Fifty Shades of Grey  1790520
28   29  Feb. 27  Fri    58      26457000          Focus (2015)  6465000

In [34]:
#只显示指定的行和列
df.iloc[[1,3,5],[0,1,2,3]]

   Row     Date  Day  Day#
1    2  Jan. 31  Sat    31
3    4   Feb. 2  Mon    33
5    6   Feb. 4  Wed    35

In [35]:
df.loc[[1,3,5],['Date', 'Gross']]

      Date     Gross
1  Jan. 31  16510536
3   Feb. 2   2645109
5   Feb. 4   2273342

## 操作单元

In [36]:
df = df_movies.copy()
# 单元格赋值
# 单个单元格赋值
df.ix[0, u'#1 Movie'] = u'土豆之歌'
df.loc[df.index[1], u'Gross']= 999
df.head(3)

/home/dormouse/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:4: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

   Row     Date  Day  Day#  Top 10 Gross         #1 Movie    Gross
0    1  Jan. 30  Fri    30      26168351             土豆之歌  9905616
1    2  Jan. 31  Sat    31      41633588  American Sniper      999
2    3   Feb. 1  Sun    32      12515579  American Sniper  4244376

In [37]:
# 多单个单元格赋值
df.loc[df.index[0:2], u'Gross'] = [100, 200]
df.head(3)

   Row     Date  Day  Day#  Top 10 Gross         #1 Movie    Gross
0    1  Jan. 30  Fri    30      26168351             土豆之歌      100
1    2  Jan. 31  Sat    31      41633588  American Sniper      200
2    3   Feb. 1  Sun    32      12515579  American Sniper  4244376

## 操作列

### 改变列头

#### 使用 columns 属性

In [38]:
df = df_movies.copy()
#用一个列表来显式地指定，列表长度必须与列数一致
# 示例 1
df.columns = [u'Row', u'Date', u'WeekDay', u'Day', u'Top10Gross', u'No1Moive', u'Gross']
df.head()

   Row     Date WeekDay  Day  Top10Gross         No1Moive     Gross
0    1  Jan. 30     Fri   30    26168351  American Sniper   9905616
1    2  Jan. 31     Sat   31    41633588  American Sniper  16510536
2    3   Feb. 1     Sun   32    12515579  American Sniper   4244376
3    4   Feb. 2     Mon   33     6475068  American Sniper   2645109
4    5   Feb. 3     Tue   34     7825091  American Sniper   2923141

In [39]:
# 示例 2 ：大写转小写
df.columns = [c.lower() for c in df.columns]
df.head()

   row     date weekday  day  top10gross         no1moive     gross
0    1  Jan. 30     Fri   30    26168351  American Sniper   9905616
1    2  Jan. 31     Sat   31    41633588  American Sniper  16510536
2    3   Feb. 1     Sun   32    12515579  American Sniper   4244376
3    4   Feb. 2     Mon   33     6475068  American Sniper   2645109
4    5   Feb. 3     Tue   34     7825091  American Sniper   2923141

#### 使用 rename 方法

In [40]:
# 示例 1 ：小写转大写
df = df.rename(columns=lambda x: x.upper())
df.tail(3)

    ROW     DATE WEEKDAY  DAY  TOP10GROSS              NO1MOIVE    GROSS
26   27  Feb. 25     Wed   56     6862942  Fifty Shades of Grey  1772230
27   28  Feb. 26     Thu   57     7161773  Fifty Shades of Grey  1790520
28   29  Feb. 27     Fri   58    26457000          Focus (2015)  6465000

In [41]:
# 示例 2 ：改变特定的列头
df = df.rename(columns={'DATE': u'日期', 'GROSS': u'票房'})
df.head()

   ROW       日期 WEEKDAY  DAY  TOP10GROSS         NO1MOIVE        票房
0    1  Jan. 30     Fri   30    26168351  American Sniper   9905616
1    2  Jan. 31     Sat   31    41633588  American Sniper  16510536
2    3   Feb. 1     Sun   32    12515579  American Sniper   4244376
3    4   Feb. 2     Mon   33     6475068  American Sniper   2645109
4    5   Feb. 3     Tue   34     7825091  American Sniper   2923141

### 打印列类型

In [42]:
df.columns.to_series().groupby(df.dtypes).groups

{dtype('int64'): Index(['ROW', 'DAY', 'TOP10GROSS', '票房'], dtype='object'),
 dtype('O'): Index(['日期', 'WEEKDAY', 'NO1MOIVE'], dtype='object')}

In [43]:
# 打印列类型(清晰打印中文)
types = df.columns.to_series().groupby(df.dtypes).groups
for key, value in types.items():
    print key,':\t', ','.join(value)

SyntaxError: invalid syntax (<ipython-input-43-fb89bdfc784b>, line 4)

### 插入列

In [ ]:
df = df_movies.copy()
# 方式一：在末尾添加
df['memo'] = pd.Series('', index=df.index)
df.head(3)

In [ ]:
# 方式二：在中间插入
df = df_movies.copy()
df.insert(loc=1, column=u'year', value=u'2015')
df.head(3)

In [ ]:
# 根据现有值生成一个新的列
df = df_movies.copy()
df.insert(loc = 5 , column=u'OtherGross', value=df[u'Top 10 Gross'] - df[u'Gross'])
df.head(3)

In [ ]:
# 根据现有值生成多个新的列
# 方法一
df = df_movies.copy()
def process_date_col(text):
    #根据日期生成月份和日两个新的列
    if pd.isnull(text):
        month = day = np.nan
    else:
        month, day = text.split('.')
    return pd.Series([month, day])

df[[u'month', u'day']] = df.Date.apply(process_date_col)
df.head()

In [ ]:
# 方法二(结果同上，但是没有方法一好)
df = df_movies.copy()
for idx, row in df.iterrows():
    df.ix[idx, u'month'], df.ix[idx, 'day'] = process_date_col(row[u'Date'])
df.head()

### 改变列值

In [ ]:
df = df_movies.copy()
#根据一列的值改变另一列
df[u'#1 Movie'] = df[u'#1 Movie'].apply(lambda x: x[::-1])
df.head(3)

In [ ]:
# 同时改变多个列的值
cols = [u'Gross', u'Top 10 Gross']
df[cols] = df[cols].applymap(lambda x: x/10000)
df.head(3)

## 操作行

In [ ]:
df = df_movies.copy()
# 添加一个空行
df = df.append(pd.Series(
                [np.nan]*len(df.columns), # Fill cells with NaNs
                index=df.columns),
                ignore_index=True)
df.tail(3)

## 空值处理（NaN）

In [ ]:
# 计数有空值的行
nans = df.shape[0] - df.dropna().shape[0]
print(u'一共有 %d 行出现空值' % nans)

# 填充空值为`无`
df.fillna(value=u'无', inplace=True)
df.tail()

## 排序

In [ ]:
df = df_movies.copy()
# 添加一个空行
df = df.append(pd.Series(
                [np.nan]*len(df.columns), # Fill cells with NaNs
                index=df.columns),
                ignore_index=True)
# 根据某一列排序（由低到高）
df.sort(u'Gross', ascending=True, inplace=True)
df.head()

In [ ]:
# 排序后重新编制索引
df.index = range(1,len(df.index)+1)
df.head()

## 过滤

In [ ]:
df = df_movies.copy()
# 根据列类型过滤
# 只选择字符串型的列
df.loc[:, (df.dtypes == np.dtype('O')).values].head()

In [ ]:
# 选择 artifact 为空值的行
df.ix[0, u'Gross'] = np.nan
df.ix[3, u'Gross'] = np.nan
df[df[u'Gross'].isnull()].head()

In [ ]:
# 选择'Gross'为非空值的行
df[df[u'Gross'].notnull()].head()

In [ ]:
# 根据条件过滤
df[ (df[u'Day'] == u'Sat') | (df[u'Day#'] <= 32) ]

In [ ]:
df[ (df[u'Day'] == u'Sat') & (df[u'Day#'] <= 32) ]

## 切片

## 合并

## 统计：计数，平均，最大，最小，方差，标准差

## 同比，环比

## 图形化

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

In [ ]:
df = df_movies.copy()
df[u'Date'] = pd.to_datetime(df[u'Date'] + ',2015' )
df.head()

In [ ]:
df.plot(x='Date', y=['Top 10 Gross', 'Gross'])

## 使用另一个 DataFrame 来更新数据

In [ ]:
df_1 = df_movies.copy()
df_2 = pd.DataFrame({u'#1 Movie':[u'American Sniper',
                            u'SpongeBob',
                            u'Fifty Shades of Grey'],
                            u'chs':[u'美国阻击手',
                                    u'海绵宝宝',
                                    u'五十度灰']})
df_1.head()

In [ ]:
df_2.head()

In [ ]:
pd.merge(df_1, df_2, on=u'#1 Movie').head()